Revit 2027 API
BuiltInFailures.StairRampFailures.ContinuousRailFilletCreationWarning Property
 Cannot create specified fillet at rail path corner.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId ContinuousRailFilletCreationWarning { get; }
Public Shared ReadOnly Property ContinuousRailFilletCreationWarning As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ ContinuousRailFilletCreationWarning {
	FailureDefinitionId^ get ();
}
static member ContinuousRailFilletCreationWarning : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace